7767517
711 838
Input                    in0                      0 1 in0
Convolution              conv_8                   1 1 in0 1 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864
Swish                    silu_144                 1 1 1 2
ConvolutionDepthWise     convdw_458               1 1 2 3 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=9216 7=2
Swish                    silu_145                 1 1 3 4
Convolution              conv_9                   1 1 4 5 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_146                 1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,32,32 1=0
Split                    splitncnn_0              1 3 8 9 10 11
ConvolutionDepthWise     convdw_459               1 1 11 12 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=288 7=32
Convolution              conv_10                  1 1 12 13 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_147                 1 1 13 14
ConvolutionDepthWise     convdw_460               1 1 14 15 0=32 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=1568 7=32
Convolution              conv_11                  1 1 15 16 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_148                 1 1 16 17
BinaryOp                 add_0                    2 1 10 17 18 0=0
Concat                   cat_0                    3 1 7 9 18 19 0=0
Convolution              conv_12                  1 1 19 20 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_149                 1 1 20 21
ConvolutionDepthWise     convdw_461               1 1 21 22 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864 7=4
Swish                    silu_150                 1 1 22 23
Convolution              conv_13                  1 1 23 24 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_151                 1 1 24 25
Slice                    split_1                  1 2 25 26 27 -23300=2,64,64 1=0
Split                    splitncnn_1              1 3 27 28 29 30
ConvolutionDepthWise     convdw_462               1 1 30 31 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=576 7=64
Convolution              conv_14                  1 1 31 32 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_152                 1 1 32 33
ConvolutionDepthWise     convdw_463               1 1 33 34 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=3136 7=64
Convolution              conv_15                  1 1 34 35 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_153                 1 1 35 36
BinaryOp                 add_1                    2 1 29 36 37 0=0
Concat                   cat_1                    3 1 26 28 37 38 0=0
Convolution              conv_16                  1 1 38 39 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_154                 1 1 39 40
Split                    splitncnn_2              1 3 40 41 42 43
ConvolutionDepthWise     convdw_464               1 1 43 44 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=0 6=2304 7=256
Convolution              conv_17                  1 1 44 45 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_155                 1 1 45 46
Convolution              conv_18                  1 1 46 47 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_156                 1 1 47 48
Split                    splitncnn_3              1 4 48 49 50 51 52
Convolution              conv_19                  1 1 52 53 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Reshape                  flatten_335              1 1 53 54 0=-1 1=256
Permute                  transpose_391            1 1 54 55 0=1
Convolution              conv_20                  1 1 51 56 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Split                    splitncnn_4              1 2 56 57 58
ConvolutionDepthWise     convdw_465               1 1 58 59 0=128 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3200 7=128
Reshape                  flatten_336              1 1 57 60 0=-1 1=128
Permute                  transpose_392            1 1 60 61 0=1
Reshape                  reshape_269              1 1 55 62 0=256 1=100 2=4
Reshape                  reshape_270              1 1 61 63 0=128 1=100 2=4
Slice                    split_2                  1 2 62 64 65 -23300=2,128,128 1=2
Permute                  transpose_393            1 1 64 66 0=1
Reshape                  view_290                 1 1 66 67 0=100 1=32 11=4 2=4
Permute                  transpose_394            1 1 65 68 0=1
Reshape                  view_291                 1 1 68 69 0=100 1=32 11=4 2=4
Permute                  transpose_395            1 1 63 70 0=1
Reshape                  view_292                 1 1 70 71 0=100 1=32 11=4 2=4
Permute                  transpose_396            1 1 67 72 0=1
MatMul                   matmul_353               2 1 72 69 73
BinaryOp                 mul_2                    1 1 73 74 0=2 1=1 2=1.767770e-01
Split                    splitncnn_5              1 2 74 75 76
Reduction                max_369                  1 1 76 77 0=4 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 sub_3                    2 1 75 77 78 0=1
UnaryOp                  exp_4                    1 1 78 79 0=7
Split                    splitncnn_6              1 2 79 80 81
Reduction                sum_383                  1 1 81 82 0=0 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 div_5                    2 1 80 82 83 0=3
MatMul                   matmultransb_0           2 1 71 83 84 0=1
Permute                  permute_251              1 1 84 85 0=4
Reshape                  reshape_271              1 1 85 86 0=128 1=20 2=20
Permute                  permute_252              1 1 86 87 0=4
BinaryOp                 add_6                    2 1 87 59 88 0=0
Convolution              conv_21                  1 1 88 89 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_7                    2 1 50 89 90 0=0
Split                    splitncnn_7              1 2 90 91 92
Convolution              conv_22                  1 1 92 93 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_157                 1 1 93 94
Convolution              conv_23                  1 1 94 95 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_8                    2 1 91 95 96 0=0
Split                    splitncnn_8              1 3 96 97 98 99
Convolution              conv_24                  1 1 99 100 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Reshape                  flatten_337              1 1 100 101 0=-1 1=256
Permute                  transpose_398            1 1 101 102 0=1
Convolution              conv_25                  1 1 98 103 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Split                    splitncnn_9              1 2 103 104 105
ConvolutionDepthWise     convdw_466               1 1 105 106 0=128 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3200 7=128
Reshape                  flatten_338              1 1 104 107 0=-1 1=128
Permute                  transpose_399            1 1 107 108 0=1
Reshape                  reshape_272              1 1 102 109 0=256 1=100 2=4
Reshape                  reshape_273              1 1 108 110 0=128 1=100 2=4
Slice                    split_3                  1 2 109 111 112 -23300=2,128,128 1=2
Permute                  transpose_400            1 1 111 113 0=1
Reshape                  view_293                 1 1 113 114 0=100 1=32 11=4 2=4
Permute                  transpose_401            1 1 112 115 0=1
Reshape                  view_294                 1 1 115 116 0=100 1=32 11=4 2=4
Permute                  transpose_402            1 1 110 117 0=1
Reshape                  view_295                 1 1 117 118 0=100 1=32 11=4 2=4
Permute                  transpose_403            1 1 114 119 0=1
MatMul                   matmul_355               2 1 119 116 120
BinaryOp                 mul_9                    1 1 120 121 0=2 1=1 2=1.767770e-01
Split                    splitncnn_10             1 2 121 122 123
Reduction                max_370                  1 1 123 124 0=4 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 sub_10                   2 1 122 124 125 0=1
UnaryOp                  exp_11                   1 1 125 126 0=7
Split                    splitncnn_11             1 2 126 127 128
Reduction                sum_384                  1 1 128 129 0=0 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 div_12                   2 1 127 129 130 0=3
MatMul                   matmultransb_1           2 1 118 130 131 0=1
Permute                  permute_253              1 1 131 132 0=4
Reshape                  reshape_274              1 1 132 133 0=128 1=20 2=20
Permute                  permute_254              1 1 133 134 0=4
BinaryOp                 add_13                   2 1 134 106 135 0=0
Convolution              conv_26                  1 1 135 136 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_14                   2 1 97 136 137 0=0
Split                    splitncnn_12             1 2 137 138 139
Convolution              conv_27                  1 1 139 140 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_158                 1 1 140 141
Convolution              conv_28                  1 1 141 142 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_15                   2 1 138 142 143 0=0
Split                    splitncnn_13             1 4 143 144 145 146 147
Convolution              conv_29                  1 1 147 148 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Reshape                  flatten_339              1 1 148 149 0=-1 1=256
Permute                  transpose_405            1 1 149 150 0=1
Convolution              conv_30                  1 1 146 151 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Split                    splitncnn_14             1 2 151 152 153
ConvolutionDepthWise     convdw_467               1 1 153 154 0=128 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3200 7=128
Reshape                  flatten_340              1 1 152 155 0=-1 1=128
Permute                  transpose_406            1 1 155 156 0=1
Reshape                  reshape_275              1 1 150 157 0=256 1=100 2=4
Reshape                  reshape_276              1 1 156 158 0=128 1=100 2=4
Slice                    split_4                  1 2 157 159 160 -23300=2,128,128 1=2
Permute                  transpose_407            1 1 159 161 0=1
Reshape                  view_296                 1 1 161 162 0=100 1=32 11=4 2=4
Permute                  transpose_408            1 1 160 163 0=1
Reshape                  view_297                 1 1 163 164 0=100 1=32 11=4 2=4
Permute                  transpose_409            1 1 158 165 0=1
Reshape                  view_298                 1 1 165 166 0=100 1=32 11=4 2=4
Permute                  transpose_410            1 1 162 167 0=1
MatMul                   matmul_357               2 1 167 164 168
BinaryOp                 mul_16                   1 1 168 169 0=2 1=1 2=1.767770e-01
Split                    splitncnn_15             1 2 169 170 171
Reduction                max_371                  1 1 171 172 0=4 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 sub_17                   2 1 170 172 173 0=1
UnaryOp                  exp_18                   1 1 173 174 0=7
Split                    splitncnn_16             1 2 174 175 176
Reduction                sum_385                  1 1 176 177 0=0 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 div_19                   2 1 175 177 178 0=3
MatMul                   matmultransb_2           2 1 166 178 179 0=1
Permute                  permute_255              1 1 179 180 0=4
Reshape                  reshape_277              1 1 180 181 0=128 1=20 2=20
Permute                  permute_256              1 1 181 182 0=4
BinaryOp                 add_20                   2 1 182 154 183 0=0
Convolution              conv_31                  1 1 183 184 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_21                   2 1 145 184 185 0=0
Split                    splitncnn_17             1 2 185 186 187
Convolution              conv_32                  1 1 187 188 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_159                 1 1 188 189
Convolution              conv_33                  1 1 189 190 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_22                   2 1 186 190 191 0=0
Split                    splitncnn_18             1 3 191 192 193 194
Convolution              conv_34                  1 1 194 195 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Reshape                  flatten_341              1 1 195 196 0=-1 1=256
Permute                  transpose_412            1 1 196 197 0=1
Convolution              conv_35                  1 1 193 198 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Split                    splitncnn_19             1 2 198 199 200
ConvolutionDepthWise     convdw_468               1 1 200 201 0=128 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3200 7=128
Reshape                  flatten_342              1 1 199 202 0=-1 1=128
Permute                  transpose_413            1 1 202 203 0=1
Reshape                  reshape_278              1 1 197 204 0=256 1=100 2=4
Reshape                  reshape_279              1 1 203 205 0=128 1=100 2=4
Slice                    split_5                  1 2 204 206 207 -23300=2,128,128 1=2
Permute                  transpose_414            1 1 206 208 0=1
Reshape                  view_299                 1 1 208 209 0=100 1=32 11=4 2=4
Permute                  transpose_415            1 1 207 210 0=1
Reshape                  view_300                 1 1 210 211 0=100 1=32 11=4 2=4
Permute                  transpose_416            1 1 205 212 0=1
Reshape                  view_301                 1 1 212 213 0=100 1=32 11=4 2=4
Permute                  transpose_417            1 1 209 214 0=1
MatMul                   matmul_359               2 1 214 211 215
BinaryOp                 mul_23                   1 1 215 216 0=2 1=1 2=1.767770e-01
Split                    splitncnn_20             1 2 216 217 218
Reduction                max_372                  1 1 218 219 0=4 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 sub_24                   2 1 217 219 220 0=1
UnaryOp                  exp_25                   1 1 220 221 0=7
Split                    splitncnn_21             1 2 221 222 223
Reduction                sum_386                  1 1 223 224 0=0 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 div_26                   2 1 222 224 225 0=3
MatMul                   matmultransb_3           2 1 213 225 226 0=1
Permute                  permute_257              1 1 226 227 0=4
Reshape                  reshape_280              1 1 227 228 0=128 1=20 2=20
Permute                  permute_258              1 1 228 229 0=4
BinaryOp                 add_27                   2 1 229 201 230 0=0
Convolution              conv_36                  1 1 230 231 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_28                   2 1 192 231 232 0=0
Split                    splitncnn_22             1 2 232 233 234
Convolution              conv_37                  1 1 234 235 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_160                 1 1 235 236
Convolution              conv_38                  1 1 236 237 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_29                   2 1 233 237 238 0=0
Concat                   cat_2                    3 1 49 144 238 239 0=0
Convolution              conv_39                  1 1 239 240 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_161                 1 1 240 241
Split                    splitncnn_23             1 3 241 242 243 244
ConvolutionDepthWise     convdw_469               1 1 244 245 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=0 6=2304 7=256
Convolution              conv_40                  1 1 245 246 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_162                 1 1 246 247
Convolution              conv_41                  1 1 247 248 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_163                 1 1 248 249
Split                    splitncnn_24             1 4 249 250 251 252 253
Convolution              conv_42                  1 1 253 254 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Reshape                  flatten_343              1 1 254 255 0=-1 1=512
Permute                  transpose_419            1 1 255 256 0=1
Convolution              conv_43                  1 1 252 257 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Split                    splitncnn_25             1 2 257 258 259
ConvolutionDepthWise     convdw_470               1 1 259 260 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
Reshape                  flatten_344              1 1 258 261 0=-1 1=256
Permute                  transpose_420            1 1 261 262 0=1
Slice                    split_6                  1 2 256 263 264 -23300=2,256,256 1=1
Permute                  transpose_421            1 1 263 265 0=1
Reshape                  view_302                 1 1 265 266 0=100 1=32 2=8
Permute                  transpose_422            1 1 264 267 0=1
Reshape                  view_303                 1 1 267 268 0=100 1=32 2=8
Permute                  transpose_423            1 1 262 269 0=1
Reshape                  view_304                 1 1 269 270 0=100 1=32 2=8
Permute                  transpose_424            1 1 266 271 0=1
MatMul                   matmul_361               2 1 271 268 272
BinaryOp                 mul_30                   1 1 272 273 0=2 1=1 2=1.767770e-01
Split                    splitncnn_26             1 2 273 274 275
Reduction                max_373                  1 1 275 276 0=4 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 sub_31                   2 1 274 276 277 0=1
UnaryOp                  exp_32                   1 1 277 278 0=7
Split                    splitncnn_27             1 2 278 279 280
Reduction                sum_387                  1 1 280 281 0=0 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 div_33                   2 1 279 281 282 0=3
MatMul                   matmultransb_4           2 1 270 282 283 0=1
Permute                  permute_259              1 1 283 284 0=4
Reshape                  reshape_281              1 1 284 285 0=256 1=10 2=10
Permute                  permute_260              1 1 285 286 0=4
BinaryOp                 add_34                   2 1 286 260 287 0=0
Convolution              conv_44                  1 1 287 288 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_35                   2 1 251 288 289 0=0
Split                    splitncnn_28             1 2 289 290 291
Convolution              conv_45                  1 1 291 292 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_164                 1 1 292 293
Convolution              conv_46                  1 1 293 294 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_36                   2 1 290 294 295 0=0
Split                    splitncnn_29             1 3 295 296 297 298
Convolution              conv_47                  1 1 298 299 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Reshape                  flatten_345              1 1 299 300 0=-1 1=512
Permute                  transpose_426            1 1 300 301 0=1
Convolution              conv_48                  1 1 297 302 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Split                    splitncnn_30             1 2 302 303 304
ConvolutionDepthWise     convdw_471               1 1 304 305 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
Reshape                  flatten_346              1 1 303 306 0=-1 1=256
Permute                  transpose_427            1 1 306 307 0=1
Slice                    split_7                  1 2 301 308 309 -23300=2,256,256 1=1
Permute                  transpose_428            1 1 308 310 0=1
Reshape                  view_305                 1 1 310 311 0=100 1=32 2=8
Permute                  transpose_429            1 1 309 312 0=1
Reshape                  view_306                 1 1 312 313 0=100 1=32 2=8
Permute                  transpose_430            1 1 307 314 0=1
Reshape                  view_307                 1 1 314 315 0=100 1=32 2=8
Permute                  transpose_431            1 1 311 316 0=1
MatMul                   matmul_363               2 1 316 313 317
BinaryOp                 mul_37                   1 1 317 318 0=2 1=1 2=1.767770e-01
Split                    splitncnn_31             1 2 318 319 320
Reduction                max_374                  1 1 320 321 0=4 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 sub_38                   2 1 319 321 322 0=1
UnaryOp                  exp_39                   1 1 322 323 0=7
Split                    splitncnn_32             1 2 323 324 325
Reduction                sum_388                  1 1 325 326 0=0 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 div_40                   2 1 324 326 327 0=3
MatMul                   matmultransb_5           2 1 315 327 328 0=1
Permute                  permute_261              1 1 328 329 0=4
Reshape                  reshape_282              1 1 329 330 0=256 1=10 2=10
Permute                  permute_262              1 1 330 331 0=4
BinaryOp                 add_41                   2 1 331 305 332 0=0
Convolution              conv_49                  1 1 332 333 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_42                   2 1 296 333 334 0=0
Split                    splitncnn_33             1 2 334 335 336
Convolution              conv_50                  1 1 336 337 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_165                 1 1 337 338
Convolution              conv_51                  1 1 338 339 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_43                   2 1 335 339 340 0=0
Split                    splitncnn_34             1 4 340 341 342 343 344
Convolution              conv_52                  1 1 344 345 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Reshape                  flatten_347              1 1 345 346 0=-1 1=512
Permute                  transpose_433            1 1 346 347 0=1
Convolution              conv_53                  1 1 343 348 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Split                    splitncnn_35             1 2 348 349 350
ConvolutionDepthWise     convdw_472               1 1 350 351 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
Reshape                  flatten_348              1 1 349 352 0=-1 1=256
Permute                  transpose_434            1 1 352 353 0=1
Slice                    split_8                  1 2 347 354 355 -23300=2,256,256 1=1
Permute                  transpose_435            1 1 354 356 0=1
Reshape                  view_308                 1 1 356 357 0=100 1=32 2=8
Permute                  transpose_436            1 1 355 358 0=1
Reshape                  view_309                 1 1 358 359 0=100 1=32 2=8
Permute                  transpose_437            1 1 353 360 0=1
Reshape                  view_310                 1 1 360 361 0=100 1=32 2=8
Permute                  transpose_438            1 1 357 362 0=1
MatMul                   matmul_365               2 1 362 359 363
BinaryOp                 mul_44                   1 1 363 364 0=2 1=1 2=1.767770e-01
Split                    splitncnn_36             1 2 364 365 366
Reduction                max_375                  1 1 366 367 0=4 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 sub_45                   2 1 365 367 368 0=1
UnaryOp                  exp_46                   1 1 368 369 0=7
Split                    splitncnn_37             1 2 369 370 371
Reduction                sum_389                  1 1 371 372 0=0 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 div_47                   2 1 370 372 373 0=3
MatMul                   matmultransb_6           2 1 361 373 374 0=1
Permute                  permute_263              1 1 374 375 0=4
Reshape                  reshape_283              1 1 375 376 0=256 1=10 2=10
Permute                  permute_264              1 1 376 377 0=4
BinaryOp                 add_48                   2 1 377 351 378 0=0
Convolution              conv_54                  1 1 378 379 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_49                   2 1 342 379 380 0=0
Split                    splitncnn_38             1 2 380 381 382
Convolution              conv_55                  1 1 382 383 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_166                 1 1 383 384
Convolution              conv_56                  1 1 384 385 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_50                   2 1 381 385 386 0=0
Split                    splitncnn_39             1 3 386 387 388 389
Convolution              conv_57                  1 1 389 390 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Reshape                  flatten_349              1 1 390 391 0=-1 1=512
Permute                  transpose_440            1 1 391 392 0=1
Convolution              conv_58                  1 1 388 393 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Split                    splitncnn_40             1 2 393 394 395
ConvolutionDepthWise     convdw_473               1 1 395 396 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
Reshape                  flatten_350              1 1 394 397 0=-1 1=256
Permute                  transpose_441            1 1 397 398 0=1
Slice                    split_9                  1 2 392 399 400 -23300=2,256,256 1=1
Permute                  transpose_442            1 1 399 401 0=1
Reshape                  view_311                 1 1 401 402 0=100 1=32 2=8
Permute                  transpose_443            1 1 400 403 0=1
Reshape                  view_312                 1 1 403 404 0=100 1=32 2=8
Permute                  transpose_444            1 1 398 405 0=1
Reshape                  view_313                 1 1 405 406 0=100 1=32 2=8
Permute                  transpose_445            1 1 402 407 0=1
MatMul                   matmul_367               2 1 407 404 408
BinaryOp                 mul_51                   1 1 408 409 0=2 1=1 2=1.767770e-01
Split                    splitncnn_41             1 2 409 410 411
Reduction                max_376                  1 1 411 412 0=4 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 sub_52                   2 1 410 412 413 0=1
UnaryOp                  exp_53                   1 1 413 414 0=7
Split                    splitncnn_42             1 2 414 415 416
Reduction                sum_390                  1 1 416 417 0=0 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 div_54                   2 1 415 417 418 0=3
MatMul                   matmultransb_7           2 1 406 418 419 0=1
Permute                  permute_265              1 1 419 420 0=4
Reshape                  reshape_284              1 1 420 421 0=256 1=10 2=10
Permute                  permute_266              1 1 421 422 0=4
BinaryOp                 add_55                   2 1 422 396 423 0=0
Convolution              conv_59                  1 1 423 424 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_56                   2 1 387 424 425 0=0
Split                    splitncnn_43             1 2 425 426 427
Convolution              conv_60                  1 1 427 428 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_167                 1 1 428 429
Convolution              conv_61                  1 1 429 430 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_57                   2 1 426 430 431 0=0
Concat                   cat_3                    3 1 250 341 431 432 0=0
Convolution              conv_62                  1 1 432 433 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_168                 1 1 433 434
Split                    splitncnn_44             1 2 434 435 436
Pooling                  avgpool2d_6              1 1 42 437 0=1 1=2 11=2 12=2 13=0 2=2 3=0 5=1 6=1
Interp                   upsample_243             1 1 436 438 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_4                    3 1 437 242 438 439 0=0
Convolution              conv_63                  1 1 439 440 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_169                 1 1 440 441
Convolution              conv_64                  1 1 441 442 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_170                 1 1 442 443
Slice                    chunk_0                  1 3 443 444 445 446 -23300=3,-233,-233,-233 1=0
Split                    splitncnn_46             1 3 446 447 448 449
Split                    splitncnn_45             1 4 445 450 451 452 453
Convolution              conv_65                  1 1 453 454 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_171                 1 1 454 455
Reshape                  flatten_351              1 1 455 456 0=-1 1=128
Permute                  transpose_447            1 1 456 457 0=1
Split                    splitncnn_47             1 5 457 458 459 460 461 462
Reduction                mean_379                 1 1 462 463 0=3 1=0 -23303=1,0 4=0 5=1
Reduction                max_377                  1 1 461 464 0=4 1=0 -23303=1,0 4=0 5=1
Concat                   cat_5                    2 1 463 464 465 0=0
InnerProduct             linear_142               1 1 465 466 0=1024 1=1 2=262144
Reshape                  view_314                 1 1 466 467 0=128 1=8
MemoryData               pnnx_fold_1450           0 1 468 0=128 1=8
BinaryOp                 add_58                   2 1 468 467 469 0=0
Gemm                     gemm_0                   1 1 459 470 10=4 2=0 3=1 4=0 5=1 6=1 7=400 8=128 9=128
Reshape                  view_315                 1 1 470 471 0=16 1=8 2=400
Permute                  transpose_448            1 1 471 472 0=2
Reshape                  view_316                 1 1 469 473 0=16 1=8 2=8
Permute                  permute_267              1 1 473 474 0=2
Reshape                  reshape_285              1 1 472 475 0=16 1=400 2=8
Reshape                  reshape_286              1 1 474 476 0=16 1=8 2=8
MatMul                   matmultransb_8           2 1 475 476 477 0=1
BinaryOp                 div_59                   1 1 477 478 0=3 1=1 2=4.000000e+00
Reshape                  view_317                 1 1 478 479 0=8 1=400 2=8
Reduction                mean_380                 1 1 479 480 0=3 1=0 -23303=1,0 4=0 5=1
Softmax                  softmax_248              1 1 480 481 0=0 1=1
Split                    splitncnn_48             1 2 481 482 483
Permute                  transpose_450            1 1 483 484 0=1
MatMul                   bmm_330                  2 1 484 460 485
Gemm                     gemm_1                   1 1 485 486 10=4 2=0 3=1 4=0 5=1 6=1 7=8 8=128 9=128
GELU                     gelu_138                 1 1 486 487
MatMul                   bmm_331                  2 1 482 487 488
Gemm                     gemm_2                   1 1 488 489 10=4 2=0 3=1 4=0 5=1 6=1 7=400 8=128 9=128
GELU                     gelu_139                 1 1 489 490
BinaryOp                 add_60                   2 1 490 458 491 0=0
Permute                  transpose_451            1 1 491 492 0=1
Reshape                  view_318                 1 1 492 493 0=20 1=20 2=128
Convolution              conv_66                  1 1 452 494 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_172                 1 1 494 495
Concat                   cat_6                    2 1 493 495 496 0=0
Convolution              conv_67                  1 1 496 497 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_173                 1 1 497 498
Convolution              conv_68                  1 1 451 499 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_174                 1 1 499 500
Reshape                  flatten_352              1 1 500 501 0=-1 1=128
Permute                  transpose_452            1 1 501 502 0=1
Split                    splitncnn_49             1 5 502 503 504 505 506 507
Reduction                mean_381                 1 1 507 508 0=3 1=0 -23303=1,0 4=0 5=1
Reduction                max_378                  1 1 506 509 0=4 1=0 -23303=1,0 4=0 5=1
Concat                   cat_7                    2 1 508 509 510 0=0
InnerProduct             linear_143               1 1 510 511 0=1024 1=1 2=262144
Reshape                  view_319                 1 1 511 512 0=128 1=8
MemoryData               pnnx_fold_1571           0 1 513 0=128 1=8
BinaryOp                 add_61                   2 1 513 512 514 0=0
Gemm                     gemm_3                   1 1 504 515 10=4 2=0 3=1 4=0 5=1 6=1 7=400 8=128 9=128
Reshape                  view_320                 1 1 515 516 0=16 1=8 2=400
Permute                  transpose_453            1 1 516 517 0=2
Reshape                  view_321                 1 1 514 518 0=16 1=8 2=8
Permute                  permute_268              1 1 518 519 0=2
Reshape                  reshape_287              1 1 517 520 0=16 1=400 2=8
Reshape                  reshape_288              1 1 519 521 0=16 1=8 2=8
MatMul                   matmultransb_9           2 1 520 521 522 0=1
BinaryOp                 div_62                   1 1 522 523 0=3 1=1 2=4.000000e+00
Reshape                  view_322                 1 1 523 524 0=8 1=400 2=8
Reduction                mean_382                 1 1 524 525 0=3 1=0 -23303=1,0 4=0 5=1
Softmax                  softmax_249              1 1 525 526 0=0 1=1
Split                    splitncnn_50             1 2 526 527 528
Permute                  transpose_455            1 1 528 529 0=1
MatMul                   bmm_333                  2 1 529 505 530
Gemm                     gemm_4                   1 1 530 531 10=4 2=0 3=1 4=0 5=1 6=1 7=8 8=128 9=128
GELU                     gelu_140                 1 1 531 532
MatMul                   bmm_334                  2 1 527 532 533
Gemm                     gemm_5                   1 1 533 534 10=4 2=0 3=1 4=0 5=1 6=1 7=400 8=128 9=128
GELU                     gelu_141                 1 1 534 535
BinaryOp                 add_63                   2 1 535 503 536 0=0
Permute                  transpose_456            1 1 536 537 0=1
Reshape                  view_323                 1 1 537 538 0=20 1=20 2=128
Convolution              conv_69                  1 1 450 539 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_175                 1 1 539 540
Concat                   cat_8                    2 1 538 540 541 0=0
Convolution              conv_70                  1 1 541 542 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_176                 1 1 542 543
Convolution              conv_71                  1 1 449 544 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_177                 1 1 544 545
Split                    splitncnn_51             1 2 545 546 547
ConvolutionDepthWise     convdw_474               1 1 547 548 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=576 7=64
Convolution              conv_72                  1 1 548 549 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_178                 1 1 549 550
ConvolutionDepthWise     convdw_475               1 1 550 551 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=3136 7=64
Convolution              conv_73                  1 1 551 552 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_179                 1 1 552 553
BinaryOp                 add_64                   2 1 546 553 554 0=0
Split                    splitncnn_52             1 2 554 555 556
ConvolutionDepthWise     convdw_476               1 1 556 557 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=576 7=64
Convolution              conv_74                  1 1 557 558 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_180                 1 1 558 559
ConvolutionDepthWise     convdw_477               1 1 559 560 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=3136 7=64
Convolution              conv_75                  1 1 560 561 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_181                 1 1 561 562
BinaryOp                 add_65                   2 1 555 562 563 0=0
Convolution              conv_76                  1 1 448 564 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_182                 1 1 564 565
Concat                   cat_9                    2 1 563 565 566 0=0
Convolution              conv_77                  1 1 566 567 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_183                 1 1 567 568
Concat                   cat_10                   5 1 444 498 447 568 543 569 0=0
Convolution              conv_78                  1 1 569 570 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=163840
Swish                    silu_184                 1 1 570 571
Split                    splitncnn_53             1 5 571 572 573 574 575 576
Interp                   upsample_244             1 1 576 577 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Split                    splitncnn_54             1 2 577 578 579
Pooling                  avgpool2d_7              1 1 575 580 0=1 1=2 11=2 12=2 13=0 2=2 3=0 5=1 6=1
Convolution              conv_79                  1 1 580 581 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_185                 1 1 581 582
Split                    splitncnn_55             1 2 582 583 584
BinaryOp                 mul_66                   1 1 572 585 0=2 1=1 2=-6.289060e-01
BinaryOp                 add_67                   2 1 243 585 586 0=0
BinaryOp                 mul_68                   1 1 578 587 0=2 1=1 2=-1.820400e-02
BinaryOp                 add_69                   2 1 41 587 588 0=0
BinaryOp                 mul_70                   1 1 583 589 0=2 1=1 2=3.579100e-01
BinaryOp                 add_71                   2 1 435 589 590 0=0
Split                    splitncnn_56             1 2 590 591 592
Interp                   upsample_245             1 1 592 593 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_11                   2 1 593 586 594 0=0
Convolution              conv_80                  1 1 594 595 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Swish                    silu_186                 1 1 595 596
Slice                    split_10                 1 2 596 597 598 -23300=2,128,128 1=0
Split                    splitncnn_57             1 3 598 599 600 601
Convolution              conv_81                  1 1 601 602 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_187                 1 1 602 603
Split                    splitncnn_58             1 2 603 604 605
ConvolutionDepthWise     convdw_478               1 1 605 606 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=1152 7=128
Convolution              conv_82                  1 1 606 607 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_188                 1 1 607 608
ConvolutionDepthWise     convdw_479               1 1 608 609 0=128 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=6272 7=128
Convolution              conv_83                  1 1 609 610 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_189                 1 1 610 611
BinaryOp                 add_72                   2 1 604 611 612 0=0
Split                    splitncnn_59             1 2 612 613 614
ConvolutionDepthWise     convdw_480               1 1 614 615 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=1152 7=128
Convolution              conv_84                  1 1 615 616 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_190                 1 1 616 617
ConvolutionDepthWise     convdw_481               1 1 617 618 0=128 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=6272 7=128
Convolution              conv_85                  1 1 618 619 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_191                 1 1 619 620
BinaryOp                 add_73                   2 1 613 620 621 0=0
Convolution              conv_86                  1 1 600 622 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_192                 1 1 622 623
Concat                   cat_12                   2 1 621 623 624 0=0
Convolution              conv_87                  1 1 624 625 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_193                 1 1 625 626
Concat                   cat_13                   3 1 597 599 626 627 0=0
Convolution              conv_88                  1 1 627 628 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_194                 1 1 628 629
Split                    splitncnn_60             1 2 629 630 631
BinaryOp                 mul_74                   1 1 573 632 0=2 1=1 2=-3.982500e-02
BinaryOp                 add_75                   2 1 630 632 633 0=0
Interp                   upsample_246             1 1 631 634 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_14                   2 1 634 588 635 0=0
Convolution              conv_89                  1 1 635 636 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_195                 1 1 636 637
Slice                    split_11                 1 2 637 638 639 -23300=2,64,64 1=0
Split                    splitncnn_61             1 3 639 640 641 642
Convolution              conv_90                  1 1 642 643 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_196                 1 1 643 644
Split                    splitncnn_62             1 2 644 645 646
ConvolutionDepthWise     convdw_482               1 1 646 647 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=576 7=64
Convolution              conv_91                  1 1 647 648 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_197                 1 1 648 649
ConvolutionDepthWise     convdw_483               1 1 649 650 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=3136 7=64
Convolution              conv_92                  1 1 650 651 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_198                 1 1 651 652
BinaryOp                 add_76                   2 1 645 652 653 0=0
Split                    splitncnn_63             1 2 653 654 655
ConvolutionDepthWise     convdw_484               1 1 655 656 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=576 7=64
Convolution              conv_93                  1 1 656 657 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_199                 1 1 657 658
ConvolutionDepthWise     convdw_485               1 1 658 659 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=3136 7=64
Convolution              conv_94                  1 1 659 660 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_200                 1 1 660 661
BinaryOp                 add_77                   2 1 654 661 662 0=0
Convolution              conv_95                  1 1 641 663 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_201                 1 1 663 664
Concat                   cat_15                   2 1 662 664 665 0=0
Convolution              conv_96                  1 1 665 666 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_202                 1 1 666 667
Concat                   cat_16                   3 1 638 640 667 668 0=0
Convolution              conv_97                  1 1 668 669 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_203                 1 1 669 670
Convolution              conv_98                  1 1 579 671 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_204                 1 1 671 672
Eltwise                  weighted_sum_0           2 1 670 672 673 0=1 -23301=2,1.000000e+00,1.685790e-01
Split                    splitncnn_64             1 3 673 674 675 676
Convolution              conv_99                  1 1 675 677 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_205                 1 1 677 678
Concat                   cat_17                   2 1 678 633 679 0=0
Convolution              conv_100                 1 1 679 680 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_206                 1 1 680 681
Slice                    split_12                 1 2 681 682 683 -23300=2,128,128 1=0
Split                    splitncnn_65             1 3 683 684 685 686
Convolution              conv_101                 1 1 686 687 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_207                 1 1 687 688
Split                    splitncnn_66             1 2 688 689 690
ConvolutionDepthWise     convdw_486               1 1 690 691 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=1152 7=128
Convolution              conv_102                 1 1 691 692 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_208                 1 1 692 693
ConvolutionDepthWise     convdw_487               1 1 693 694 0=128 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=6272 7=128
Convolution              conv_103                 1 1 694 695 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_209                 1 1 695 696
BinaryOp                 add_80                   2 1 689 696 697 0=0
Split                    splitncnn_67             1 2 697 698 699
ConvolutionDepthWise     convdw_488               1 1 699 700 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=1152 7=128
Convolution              conv_104                 1 1 700 701 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_210                 1 1 701 702
ConvolutionDepthWise     convdw_489               1 1 702 703 0=128 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=6272 7=128
Convolution              conv_105                 1 1 703 704 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_211                 1 1 704 705
BinaryOp                 add_81                   2 1 698 705 706 0=0
Convolution              conv_106                 1 1 685 707 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_212                 1 1 707 708
Concat                   cat_18                   2 1 706 708 709 0=0
Convolution              conv_107                 1 1 709 710 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_213                 1 1 710 711
Concat                   cat_19                   3 1 682 684 711 712 0=0
Convolution              conv_108                 1 1 712 713 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_214                 1 1 713 714
Split                    splitncnn_68             1 2 714 715 716
BinaryOp                 mul_82                   1 1 574 717 0=2 1=1 2=1.136470e-01
BinaryOp                 add_83                   2 1 715 717 718 0=0
Split                    splitncnn_69             1 2 718 719 720
Convolution              conv_109                 1 1 716 721 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_215                 1 1 721 722
Concat                   cat_20                   2 1 722 591 723 0=0
Convolution              conv_110                 1 1 723 724 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_216                 1 1 724 725
Slice                    split_13                 1 2 725 726 727 -23300=2,256,256 1=0
Split                    splitncnn_70             1 3 727 728 729 730
Convolution              conv_111                 1 1 730 731 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_217                 1 1 731 732
Split                    splitncnn_71             1 2 732 733 734
ConvolutionDepthWise     convdw_490               1 1 734 735 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=2304 7=256
